Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_sflash.c
    if (SF_CTRL_QIO_MODE == ioMode || SF_CTRL_DIO_MODE == ioMode) {
        noReadModeCfg = flashCfg->cReadSupport & 0x02;
        cReadSupport = flashCfg->cReadSupport & 0x01;

        if (noReadModeCfg == 0) {
            /* Read mode must be set*/
            if (cReadSupport == 0) {
                /* Not support cont read,but we still need set read mode(winbond 80dv)*/
                flashCmd.cmdBuf[1] = (flashCfg->cReadMode << 24);
            } else {
                /* Flash support cont read, setting depend on user parameter */
                if (contRead) {
                    flashCmd.cmdBuf[0] = (addr << 8) | flashCfg->cReadMode;
                    cmdValid = 0;
                } else {
                    flashCmd.cmdBuf[1] = ((!flashCfg->cReadMode) << 24);
                }
            }

            flashCmd.addrSize++;
        }
    }

    flashCmd.dummyClks = dummyClks;
    flashCmd.nbData = len;
    SF_Ctrl_Icache_Set(&flashCmd, cmdValid);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable I/D bus read from flash
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  ioMode: flash controller interface mode
 * @param  contRead: Wether enable cont read mode
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_IDbus_Read_Enable(SPI_Flash_Cfg_Type *flashCfg, SF_Ctrl_IO_Type ioMode, uint8_t contRead)
{
    BL_Err_Type stat;

    stat = SFlash_Set_IDbus_Cfg(flashCfg, ioMode, contRead, 0, 4);

    if (SUCCESS != stat) {
        return stat;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable cache
 *
 * @param  wayDisable: cache way disable config
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Cache_Enable_Set(uint8_t wayDisable)
{
    uint32_t tmpVal;
    uint32_t cnt = 0;

    /* Set cacheable to 0 */
    tmpVal = BL_RD_REG(L1C_BASE, L1C_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, L1C_CACHEABLE);
    tmpVal = BL_SET_REG_BIT(tmpVal, L1C_BYPASS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, L1C_WAY_DIS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, L1C_CNT_EN);
    BL_WR_REG(L1C_BASE, L1C_CONFIG, tmpVal);

    tmpVal = BL_RD_REG(L1C_BASE, L1C_CONFIG);
    /*Set Tag RAM to zero */
    tmpVal = BL_CLR_REG_BIT(tmpVal, L1C_INVALID_EN);
    BL_WR_REG(L1C_BASE, L1C_CONFIG, tmpVal);
    /* Left space for hardware change status*/
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    tmpVal = BL_SET_REG_BIT(tmpVal, L1C_INVALID_EN);
    BL_WR_REG(L1C_BASE, L1C_CONFIG, tmpVal);
    /* Left space for hardware change status*/
    __NOP();
    __NOP();
    __NOP();
    __NOP();

    /* Polling for invalid done */
    do {
        BL602_Delay_US(1);
        cnt++;
        tmpVal = BL_RD_REG(L1C_BASE, L1C_CONFIG);
    } while (!BL_IS_REG_BIT_SET(tmpVal, L1C_INVALID_DONE) && cnt < 100);

    tmpVal = BL_SET_REG_BIT(tmpVal, L1C_BYPASS);
    BL_WR_REG(L1C_BASE, L1C_CONFIG, tmpVal);

    tmpVal = BL_CLR_REG_BIT(tmpVal, L1C_BYPASS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, L1C_WAY_DIS);
    tmpVal = BL_SET_REG_BIT(tmpVal, L1C_CNT_EN);
    BL_WR_REG(L1C_BASE, L1C_CONFIG, tmpVal);

    tmpVal |= (wayDisable << L1C_WAY_DIS_POS);

    /* If way disable is 0x0f, cacheable can't be set */
    if (wayDisable != 0x0f) {
        tmpVal = BL_SET_REG_BIT(tmpVal, L1C_CACHEABLE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, L1C_CACHEABLE);
    }

    BL_WR_REG(L1C_BASE, L1C_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Flush cache
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Cache_Flush(void)
{
    uint32_t tmpVal;

    /* Disable early respone */
    tmpVal = BL_RD_REG(L1C_BASE, L1C_CONFIG);
    SFlash_Cache_Enable_Set((tmpVal >> L1C_WAY_DIS_POS) & 0xf);
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable cache read from flash with cache
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  ioMode: flash controller interface mode
 * @param  contRead: Wether enable cont read mode
 * @param  wayDisable: cache way disable config
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Cache_Read_Enable(SPI_Flash_Cfg_Type *flashCfg,
                                                      SF_Ctrl_IO_Type ioMode, uint8_t contRead, uint8_t wayDisable)
{
    BL_Err_Type stat;

    /* Cache now only support 32 bytes read */
    stat = SFlash_Set_IDbus_Cfg(flashCfg, ioMode, contRead, 0, 32);

    if (SUCCESS != stat) {
        return stat;
    }

    return SFlash_Cache_Enable_Set(wayDisable);
}

/****************************************************************************/ /**
 * @brief  Get cache hit count
 *
 * @param  hitCountLow: hit count low 32 bits pointer
 * @param  hitCountHigh: hit count high 32 bits pointer
 *
 * @return None
 *
*******************************************************************************/
__WEAK
void ATTR_TCM_SECTION SFlash_Cache_Hit_Count_Get(uint32_t *hitCountLow, uint32_t *hitCountHigh)
{
    *hitCountLow = BL_RD_REG(L1C_BASE, L1C_HIT_CNT_LSB);
    *hitCountHigh = BL_RD_REG(L1C_BASE, L1C_HIT_CNT_MSB);
}

/****************************************************************************/ /**
 * @brief  Get cache miss count
 *
 * @param  None
 *
 * @return Cache miss count
 *
*******************************************************************************/
__WEAK
uint32_t ATTR_TCM_SECTION SFlash_Cache_Miss_Count_Get(void)
{
    return BL_RD_REG(L1C_BASE, L1C_MISS_CNT);
}

/****************************************************************************/ /**
 * @brief  Disable read from flash with cache
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
__WEAK
void ATTR_TCM_SECTION SFlash_Cache_Read_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(L1C_BASE, L1C_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, L1C_CACHEABLE);
    BL_WR_REG(L1C_BASE, L1C_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Read data from flash
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  ioMode: flash controller interface mode
 * @param  contRead: Wether enable cont read mode
 * @param  addr: flash read start address
 * @param  data: data pointer to store data read from flash
 * @param  len: data length to read
 *
 * @return None
 *
*******************************************************************************/
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Read(SPI_Flash_Cfg_Type *flashCfg,
                                         SF_Ctrl_IO_Type ioMode, uint8_t contRead, uint32_t addr, uint8_t *data, uint32_t len)
{
    uint8_t *const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    uint32_t curLen, i;
    uint8_t cmd, dummyClks;
    uint32_t timeOut = 0;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint8_t noReadModeCfg = 0;
    uint8_t cReadSupport = 0;

    if (((uint32_t)&flashCmd) % 4 == 0) {
        BL602_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    } else {
        BL602_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

